# -*- coding: UTF-8 -*-

### xray ###

xray_y_ticks_left = [ u'10⁻⁸'
				, u'10⁻⁷'
				, u'10⁻⁶'
				, u'10⁻⁵'
				, u'10⁻⁴'
				, u'10⁻³', u'10⁻²'
				, '' ]

xray_y_ticks_right = [ ''
				, ''
				, ''
				, u'Слабые'
				, u'Сильные\n\nСредние'
				, u'Экстрим\n\nЖесткие'
				, ''
				, '' ]


xray_plot_tile = u'    Рентгеновское излучение λ = 0.1 - 0.8 нм          Нарушения радиосвязи'

### xray ###



### proton ###

proton_y_label = u'Протон/см²-сек-стер'
proton_x_labe_part = u'\nВремя: '

proton_y_ticks_left = [ '1'
						, '10'
						, ''
						, ''
						, ''
						, ''
						, ''
						, ''
						, ''
						, ''
						, ''
						, ''
						, ''
						, u'10²'
						, ''
						, ''
						, u'10³'
						, u'10⁴'
						, u'10⁵' ]

proton_y_ticks_right = [ ''
						, u'Слабый'
						, ''
						, ''
						, ''
						, ''
						, u'Средний'
						, ''
						, u'Сильный' ]

protong_title = u'Поток протонов с энергией >10 МэВ                           Уровень радиации'

### proton ###


### geomag ###

geomag_y_ticks_right = [ ''
						, u'Cпокойное'
						, u'\nCлабое возмущение'
						, ''
						, u'Возмущенное'
						, ''
						, u'\n\nМагнитная буря'
						, u'Жесткая буря'
						, u'Экстрим'
						, '' ]

geomag_plot_title = u'       Геомагнитный индекс                                            Магнитная поле\n'

### geoamg ###

